; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=159, out_folder=htg/blocksworld/training, instance_id=13, seed=2037, goal_proportion=0.03

(define (problem blocksworld-13)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 - object)
 (:init 
    (arm-empty)
    (clear b31)
    (on b31 b151)
    (on b151 b124)
    (on b124 b70)
    (on b70 b140)
    (on-table b140)
    (clear b96)
    (on b96 b82)
    (on b82 b73)
    (on-table b73)
    (clear b93)
    (on-table b93)
    (clear b128)
    (on-table b128)
    (clear b130)
    (on-table b130)
    (clear b122)
    (on b122 b83)
    (on b83 b11)
    (on b11 b22)
    (on b22 b41)
    (on b41 b154)
    (on b154 b2)
    (on b2 b89)
    (on b89 b103)
    (on b103 b116)
    (on-table b116)
    (clear b54)
    (on b54 b63)
    (on b63 b24)
    (on b24 b92)
    (on b92 b28)
    (on b28 b35)
    (on-table b35)
    (clear b121)
    (on b121 b111)
    (on b111 b101)
    (on b101 b85)
    (on b85 b55)
    (on b55 b33)
    (on b33 b5)
    (on b5 b44)
    (on b44 b98)
    (on b98 b1)
    (on b1 b4)
    (on b4 b75)
    (on b75 b59)
    (on b59 b146)
    (on-table b146)
    (clear b95)
    (on b95 b39)
    (on b39 b51)
    (on-table b51)
    (clear b94)
    (on-table b94)
    (clear b7)
    (on b7 b152)
    (on b152 b42)
    (on b42 b72)
    (on b72 b105)
    (on b105 b26)
    (on b26 b53)
    (on b53 b148)
    (on b148 b114)
    (on b114 b135)
    (on b135 b57)
    (on-table b57)
    (clear b46)
    (on b46 b150)
    (on-table b150)
    (clear b36)
    (on-table b36)
    (clear b76)
    (on b76 b38)
    (on b38 b137)
    (on b137 b49)
    (on b49 b142)
    (on b142 b126)
    (on b126 b18)
    (on b18 b115)
    (on-table b115)
    (clear b60)
    (on b60 b149)
    (on b149 b84)
    (on-table b84)
    (clear b40)
    (on b40 b50)
    (on b50 b16)
    (on b16 b159)
    (on b159 b78)
    (on b78 b61)
    (on b61 b30)
    (on-table b30)
    (clear b155)
    (on-table b155)
    (clear b29)
    (on b29 b8)
    (on-table b8)
    (clear b91)
    (on b91 b3)
    (on b3 b119)
    (on b119 b10)
    (on-table b10)
    (clear b90)
    (on b90 b123)
    (on-table b123)
    (clear b27)
    (on-table b27)
    (clear b14)
    (on b14 b81)
    (on b81 b108)
    (on b108 b21)
    (on b21 b71)
    (on b71 b157)
    (on b157 b58)
    (on b58 b37)
    (on b37 b9)
    (on b9 b147)
    (on b147 b138)
    (on b138 b64)
    (on b64 b129)
    (on b129 b120)
    (on-table b120)
    (clear b74)
    (on b74 b32)
    (on b32 b6)
    (on b6 b67)
    (on b67 b104)
    (on b104 b13)
    (on b13 b86)
    (on-table b86)
    (clear b79)
    (on b79 b144)
    (on b144 b156)
    (on b156 b132)
    (on b132 b107)
    (on-table b107)
    (clear b48)
    (on-table b48)
    (clear b43)
    (on b43 b153)
    (on b153 b100)
    (on b100 b133)
    (on b133 b20)
    (on b20 b23)
    (on b23 b158)
    (on b158 b52)
    (on b52 b127)
    (on-table b127)
    (clear b139)
    (on-table b139)
    (clear b109)
    (on b109 b112)
    (on-table b112)
    (clear b88)
    (on b88 b113)
    (on b113 b136)
    (on b136 b19)
    (on b19 b131)
    (on b131 b62)
    (on b62 b47)
    (on b47 b102)
    (on b102 b99)
    (on b99 b87)
    (on b87 b125)
    (on b125 b56)
    (on b56 b145)
    (on b145 b17)
    (on-table b17)
    (clear b141)
    (on b141 b118)
    (on-table b118)
    (clear b106)
    (on b106 b134)
    (on b134 b77)
    (on b77 b45)
    (on b45 b68)
    (on b68 b110)
    (on-table b110)
    (clear b69)
    (on b69 b65)
    (on-table b65)
    (clear b25)
    (on-table b25)
    (clear b97)
    (on-table b97)
    (clear b12)
    (on b12 b34)
    (on b34 b117)
    (on b117 b80)
    (on b80 b15)
    (on-table b15)
    (clear b143)
    (on-table b143)
    (clear b66)
    (on-table b66))
 (:goal  (and 
    (clear b4)
    (on b4 b2)
    (on-table b2)
    (clear b1)
    (on-table b1)
    (clear b3)
    (on-table b3))))

; plan
1. (unstack b121 b111)
   deleted: (on b121 b111) (clear b121) (arm-empty)
   added: (holding b121) (clear b111)
   goals met: 0 of 7
2. (putdown b121)
   deleted: (holding b121)
   added: (clear b121) (arm-empty) (on-table b121)
   goals met: 0 of 7
3. (unstack b111 b101)
   deleted: (on b111 b101) (clear b111) (arm-empty)
   added: (holding b111) (clear b101)
   goals met: 0 of 7
4. (putdown b111)
   deleted: (holding b111)
   added: (clear b111) (arm-empty) (on-table b111)
   goals met: 0 of 7
5. (unstack b101 b85)
   deleted: (on b101 b85) (clear b101) (arm-empty)
   added: (holding b101) (clear b85)
   goals met: 0 of 7
6. (putdown b101)
   deleted: (holding b101)
   added: (clear b101) (arm-empty) (on-table b101)
   goals met: 0 of 7
7. (unstack b122 b83)
   deleted: (on b122 b83) (clear b122) (arm-empty)
   added: (holding b122) (clear b83)
   goals met: 0 of 7
8. (putdown b122)
   deleted: (holding b122)
   added: (clear b122) (arm-empty) (on-table b122)
   goals met: 0 of 7
9. (unstack b83 b11)
   deleted: (on b83 b11) (clear b83) (arm-empty)
   added: (holding b83) (clear b11)
   goals met: 0 of 7
10. (putdown b83)
   deleted: (holding b83)
   added: (clear b83) (arm-empty) (on-table b83)
   goals met: 0 of 7
11. (unstack b11 b22)
   deleted: (on b11 b22) (clear b11) (arm-empty)
   added: (holding b11) (clear b22)
   goals met: 0 of 7
12. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 7
13. (unstack b22 b41)
   deleted: (on b22 b41) (clear b22) (arm-empty)
   added: (holding b22) (clear b41)
   goals met: 0 of 7
14. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 7
15. (unstack b41 b154)
   deleted: (on b41 b154) (clear b41) (arm-empty)
   added: (holding b41) (clear b154)
   goals met: 0 of 7
16. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 0 of 7
17. (unstack b154 b2)
   deleted: (on b154 b2) (clear b154) (arm-empty)
   added: (holding b154) (clear b2)
   goals met: 0 of 7
18. (putdown b154)
   deleted: (holding b154)
   added: (clear b154) (arm-empty) (on-table b154)
   goals met: 0 of 7
19. (unstack b2 b89)
   deleted: (on b2 b89) (clear b2) (arm-empty)
   added: (holding b2) (clear b89)
   goals met: 0 of 7
20. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 7
21. (unstack b85 b55)
   deleted: (on b85 b55) (clear b85) (arm-empty)
   added: (holding b85) (clear b55)
   goals met: 1 of 7
22. (putdown b85)
   deleted: (holding b85)
   added: (clear b85) (arm-empty) (on-table b85)
   goals met: 1 of 7
23. (unstack b55 b33)
   deleted: (on b55 b33) (clear b55) (arm-empty)
   added: (holding b55) (clear b33)
   goals met: 1 of 7
24. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 1 of 7
25. (unstack b33 b5)
   deleted: (on b33 b5) (clear b33) (arm-empty)
   added: (holding b33) (clear b5)
   goals met: 1 of 7
26. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 1 of 7
27. (unstack b5 b44)
   deleted: (on b5 b44) (clear b5) (arm-empty)
   added: (holding b5) (clear b44)
   goals met: 1 of 7
28. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 7
29. (unstack b44 b98)
   deleted: (on b44 b98) (clear b44) (arm-empty)
   added: (holding b44) (clear b98)
   goals met: 1 of 7
30. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 1 of 7
31. (unstack b91 b3)
   deleted: (on b91 b3) (clear b91) (arm-empty)
   added: (holding b91) (clear b3)
   goals met: 2 of 7
32. (putdown b91)
   deleted: (holding b91)
   added: (clear b91) (arm-empty) (on-table b91)
   goals met: 2 of 7
33. (unstack b3 b119)
   deleted: (on b3 b119) (clear b3) (arm-empty)
   added: (holding b3) (clear b119)
   goals met: 1 of 7
34. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 7
35. (unstack b98 b1)
   deleted: (on b98 b1) (clear b98) (arm-empty)
   added: (holding b98) (clear b1)
   goals met: 4 of 7
36. (putdown b98)
   deleted: (holding b98)
   added: (clear b98) (arm-empty) (on-table b98)
   goals met: 4 of 7
37. (unstack b1 b4)
   deleted: (on b1 b4) (clear b1) (arm-empty)
   added: (holding b1) (clear b4)
   goals met: 4 of 7
38. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 6 of 7
39. (unstack b4 b75)
   deleted: (on b4 b75) (clear b4) (arm-empty)
   added: (holding b4) (clear b75)
   goals met: 5 of 7
40. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 7 of 7
